/*
Задание 1
Службе ИТ-мониторинга необходимо составить хронологический лог всех действий пользователей в системе 
за определенный период для оценки нагрузки на серверную инфраструктуру. 
На основе таблицы журналов событий рейса (history) и таблицы посадочных талонов (boarding) 
сформируйте единый реестр зафиксированных операций за период с 10 по 12 августа 2026 года включительно. 
Итоговая таблица должна содержать два столбца: точную дату-время проведения операции и текстовый тип события. 
Для записей из первой таблицы в поле типа события выведите текстовое значение «Изменение статуса рейса», 
а для записей из второй таблицы – «Выдача посадочного талона».
*/
select status_time, ('Изменение статуса рейса') as type from history
where status_time between '2026-08-10 00:00:00' and '2026-08-12 23:59:59'
union
select registration_time, ('Выдача посадочного талона') as type from boarding
where registration_time between '2026-08-10 00:00:00' and '2026-08-12 23:59:59';

/*
Задание 2
Департамент маркетинга ищет лояльных клиентов для закрытого опроса о качестве семейных перевозок. 
Аналитикам нужно найти взрослых пассажиров, которые не просто летают сами, но и оплачивают билеты для детей. 
На основе таблицы пассажиров (passenger) и таблицы билетов (ticket) найдите пересечение двух списков. 
В первый список включите ФИО всех клиентов из категории «Взрослый», на которых были оформлены авиабилеты. 
Во второй список включите ФИО клиентов, 
которые выступили покупателями билетов для пассажиров из категории «Ребенок».
*/

select full_name from passenger
where category_name = 'Взрослый'
intersect
select p1.full_name from ticket t1 
join passenger p1 on p1.passenger_id = t1.passenger_id 
join ticket t2 on t2.booking_id = t1.booking_id and t2.passenger_id != t1.passenger_id
join passenger p2 on p2.passenger_id = t2.passenger_id
where p2.category_name = 'Ребенок';

/*
Задание 3
Отдел управления качеством сервиса анализирует эксплуатацию премиального фонда авиакомпании. 
Руководству необходимо выявить модели самолетов, на которых ни разу не летали пассажиры бизнес-класса. 
На основе таблицы самолетов (airplane), таблицы мест в салоне (seat) и 
таблицы посадочных талонов (boarding) сформируйте список идентификаторов воздушных судов, 
исключив из парка авиакомпании те борта,
на которые зафиксирован хотя бы один посадочный талон в класс обслуживания 'Бизнес'.
*/

select airplane_id from airplane 
except
select s.airplane_id from seat s
join boarding b on b.seat_id = s.seat_id
where s.fare_conditions = 'Бизнес';

/*
Задание 4
Служба организации перевозок оценивает операционную загрузку аэропортов вылета для оптимизации расписания 
наземных служб. 
Аналитикам необходимо определить авиаузлы, из которых отправляется наибольшее количество рейсов. 
Используя обобщенное табличное выражение, подготовьте временный слой на основе таблицы вылетов (flight) 
и таблицы маршрутов (route), рассчитав общее количество фактически
запланированных рейсов для каждого аэропорта вылета. 
В основном запросе, соединив этот слой с таблицей аэропортов (airport), 
выведите названия тех аэропортов, у которых количество вылетов превышает среднее количество рейсов, 
приходящееся на один работающий аэропорт компании.
*/

with dep_count as(
select r.departure_airport_id, count(*) as count_flight from flight f join route r on r.route_id = f.route_id
group by r.departure_airport_id
)
select a.airport_name from dep_count d join airport a on a.airport_id = d.departure_airport_id
where d.count_flight > (select avg(count_flight) from dep_count);

/*
Задание 5
Коммерческий департамент оценивает финансовую отдачу от эксплуатации действующих авиамаршрутов 
для выявления наименее прибыльных направлений. Аналитикам необходимо сопоставить 
общую выручку от продажи билетов с условными затратами на выполнение рейсов 
(приняв стоимость одной минуты полета за 1000 рублей). 
Используя обобщенные табличные выражения, создайте цепочку из двух временных слоев:
•	В первом слое на основе таблицы билетов (ticket) и таблицы вылетов (flight) 
рассчитайте суммарную выручку по каждому уникальному номеру маршрута (route_id).
•	Во втором слое на основе таблицы вылетов (flight) и таблицы маршрутов (route) 
рассчитайте суммарную длительность в минутах всех выполненных и запланированных рейсов для каждого маршрута.
В основном запросе объедините оба слоя с таблицей маршрутов (route), выведите номер рейса (route_no), 
общую выручку, общие расчетные затраты и итоговую чистую прибыль направления.
*/

with ticket_sum as (
select f.route_id, sum(t.price) as price_r from flight f join ticket t on t.flight_id = f.flight_id
group by f.route_id
),
duration as(
select f.route_id, sum(r.duration_min) as sum_dur from flight f join route r on r.route_id = f.route_id
group by f.route_id
)
select route_no, coalesce(t.price_r,0) as revenue, (coalesce(d.sum_dur,0) * 1000) as minus, 
(coalesce(t.price_r,0) - (coalesce(d.sum_dur,0) * 1000)) as total_amount from route r 
left join ticket_sum t on t.route_id = r.route_id
left join duration d on d.route_id = r.route_id;

/*
Задание 6
Коммерческий департамент распределяет бюджет на техническое обслуживание воздушных судов и 
хочет оценить реальный вклад каждого лайнера в доходы компании. 
Аналитикам необходимо рассчитать, какую долю (в процентах) занимает выручка конкретного самолета 
в общей структуре доходов авиакомпании. 
Используя обобщенное табличное выражение, подготовьте временный слой на основе 
таблицы билетов (ticket) и таблицы вылетов (flight), рассчитав суммарную выручку отдельно 
для каждого идентификатора самолета (airplane_id). 
В основном запросе, соединив полученный слой с таблицей самолетов (airplane), 
выведите бренд, модель лайнера и долю его выручки в процентах от общей суммы 
всех проданных билетов авиакомпании.
*/

with airplane_amount as(
select f.airplane_id, sum(t.price) as sum_price from flight f join ticket t on t.flight_id = f.flight_id
group by f.airplane_id
)
select a.brand, a.model, 
round(100 * am.sum_price / (select sum(sum_price) from airplane_amount),2) as percent 
from airplane_amount as am 
join airplane a on a.airplane_id = am.airplane_id; 

/*
Задание 7
Служба бортового сервиса организует премиальное обслуживание в полете для самых юных путешественников. 
Для всех детей, отправляющихся в длительные перелеты, авиакомпания централизованно включает в 
состав заказа специальный детский набор. Стоимость набора составляет 2500 рублей, однако для клиента 
он должен быть бесплатным. 
Используя обобщенное табличное выражение, сформируйте временный слой идентификаторов билетов (ticket_id) 
на основе таблиц билетов (ticket), пассажиров (passenger) и маршрутов (route), 
отобрав билеты детей на дальних маршрутах (расстояние превышает 4000 км).
В основном запросе обновите таблицу билетов (ticket): пропишите стоимость дополнительных услуг (service_price) 
в размере 2500 рублей, но одновременно предоставьте скидку на эту же сумму, 
уменьшив поле фактического тарифа (actual_rate) на 2500 рублей, 
чтобы итоговая финальная стоимость билета (price) осталась неизменной.
*/

begin;

with child_ticket as (
select t.ticket_id from ticket t join passenger p on p.passenger_id = t.passenger_id
join flight f on f.flight_id = t.flight_id
join route r on r.route_id = f.route_id
where r.distance_km > 4000 and p.category_name = 'Ребенок'
)
update ticket
set service_price = 2500, actual_rate = actual_rate - 2500
where ticket_id in (select ticket_id from child_ticket)

returning
    t.ticket_id,
    t.actual_rate,
    t.service_price,
    t.price;

rollback;

/*
Задание 8
Служба ИТ-безопасности проводит регламентную очистку операционной базы данных от ошибочных 
или устаревших записей в логах, которые потеряли актуальность для управления. 
Используя обобщенное табличное выражение (WITH),
сформируйте временный список идентификаторов вылетов (flight_id), 
рейсы по которым были официально отменены в сентябре 2026 года. 
В основном запросе произведите безвозвратное удаление из таблицы журналов событий рейса (history) 
абсолютно всех записей об изменениях статусов, привязанных к этим отмененным сентябрьским вылетам.
*/

begin;

with useless as(
select distinct flight_id from history
where status_name = 'Отменен' and status_time between '2026-09-01 00:00:00' and '2026-09-30 23:59:59'
)
delete from history
where flight_id in (select flight_id from useless)
returning
    h.history_id,
    h.flight_id,
    h.status_name,
    h.status_time;

rollback;


/*
Задание 9
Финансово-экономическая служба формирует сводную ведомость продаж для анализа структуры доходов. 
Чтобы оценить масштабы каждой коммерческой операции, руководству необходимо сопоставить параметры 
каждого проданного билета с общими продажами предприятия. 
На основе таблиц билетов (ticket), вылетов (flight), маршрутов (route) и городов (city) 
выведите номер рейса (route_no), название города прилета и итоговую финальную стоимость билета (price). 
С помощью аналитической оконной функции с пустым окном рассчитайте и выведите в отдельном 
столбце общую сумму выручки от продажи абсолютно всех билетов авиакомпании.
Дополнительно вычислите долю (в процентах) стоимости текущего билета в общем объеме доходов компании.
*/

select r.route_no, c.city_name, t.price, sum(t.price) over() as amount,
round(100 * t.price/sum(price) over(),2) as percent from ticket t join flight f on f.flight_id = t.flight_id
join route r on r.route_id = f.route_id
join airport a on a.airport_id = r.arrival_airport_id
join city c on c.city_id = a.city_id;

/*
Задание 10
Коммерческий департамент отслеживает ежедневную динамику поступления денежных 
средств для оценки скорости заполняемости рейсов. Аналитикам необходим финансовый отчет, 
отображающий накопление выручки по дням за отчетный период. 
На основе таблиц билетов (ticket), вылетов (flight) и маршрутов (route) 
выведите номер рейса по расписанию (route_no), дату продажи билета (sale_date) и стоимость продажи (price). 
Ограничьте анализ продажами, совершенными в 3 квартале 2026 года. 
С помощью аналитической оконной функции рассчитайте кумулятивную сумму выручки, 
которая формируется нарастающим итогом по мере продажи билетов. 
Настройте окно так, чтобы этот накопительный итог 
рассчитывался отдельно для каждого номера рейса и увеличивался в хронологическом порядке дат продаж.
*/

select r.route_no, t.sale_date, t.price, 
sum(price) over(partition by route_no order by t.sale_date) as sum_revenue
from ticket t join flight f on f.flight_id = t.flight_id
join route r on r.route_id = f.route_id
where t.sale_date between '2026-07-01' and '2026-09-30'
order by t.sale_date;

/*
Задание 11
Служба тарифообразования анализирует структуру продаж на популярных направлениях для оценки 
эффективности действующих тарифных сеток. Аналитикам необходимо определить ранги стоимости билетов на рейсах, 
выполняемых лайнерами определенного класса. 
На основе таблиц билетов (ticket), вылетов (flight), маршрутов (route), самолетов (airplane) 
и пассажиров (passenger) выведите идентификатор вылета (flight_id), номер рейса (route_no), 
бренд и модель самолета, ФИО пассажира и итоговую финальную стоимость билета (price). 
Ограничьте итоговый отчет рейсами, которые выполняются на воздушных судах 
с классом магистральности 'Среднемагистральный'. 
С помощью функции ранжирования оконных функций присвойте ранг каждой продаже так, 
чтобы нумерация велась отдельно для каждого конкретного рейса в порядке убывания стоимости 
билетов (от дорогих к дешевым). При наличии билетов с одинаковой ценой в рамках одного рейса 
они должны получить одинаковый ранг, а следующий за ними номер ранга не должен прерываться.
Примечание: Пример ожидаемого распределения рангов при совпадении цен: 1, 1, 2, 3, 3, 4.
*/

select f.flight_id, r.route_no, a.brand, a.model, p.full_name, t.price, dense_rank() over (partition by f.flight_id order by t.price desc) as rn 
from flight f join airplane a on a.airplane_id = f.airplane_id 
join route r on r.route_id = f.route_id
join ticket t on t.flight_id = f.flight_id
join passenger p on p.passenger_id = t.passenger_id
where a.airplane_class = 'Среднемагистральный';

/*
Задание 12
Служба диспетчеризации базового аэропорта Пулково (идентификатор 131) проводит хронометраж 
наземного обслуживания воздушных судов для сокращения задержек рейсов. 
Аналитикам необходимо рассчитать точные временные интервалы между последовательными 
этапами подготовки самолетов к вылету.
Используя обобщенное табличное выражение, подготовьте предварительный слой 
данных на основе таблиц журналов событий рейса (history), вылетов (flight) и маршрутов (route) 
Ограничьте анализ рейсами, у которых аэропортом отправления является указанный авиаузел. 
Внутри временного слоя с помощью оконных функций смещения извлеките для каждой записи 
наименование предыдущего статуса и время его фиксации.
В основном запросе выведите идентификатор вылета (flight_id), номер рейса (route_no), 
текущий и предыдущий статусы, а также рассчитайте разницу в минутах между временем текущего 
и предыдущего события.

Примечание: Для расчёта разницы между двумя отметками времени можно использовать стандартную конструкцию: 
EXTRACT(EPOCH FROM (Время1 - Время2)).
Параметр EPOCH автоматически переводит полученный промежуток времени в секунды.

*/

with pulk as(
select f.flight_id, r.route_no ,h.status_name, h.status_time, 
lag(h.status_name) over(partition by f.flight_id order by h.status_time) as prev_status, 
lag(h.status_time) over(partition by f.flight_id order by h.status_time) as prev_time from history h
join flight f on f.flight_id = h.flight_id
join route r on r.route_id = f.route_id
where r.departure_airport_id = 131
)
select flight_id, route_no, status_name, prev_status, ceil(extract(epoch from(status_time - prev_time))/ 60) as diff from pulk;